export type MemoItem = {
  id: string;
  date: string; 
  text: string;  
};

export const MEMOS: MemoItem[] = [
  {
    id: "m16",
    date: "2026. 02. 22",
    text: "쿠키 맛있다...\n근데 아까워서 어떻게 먹지.\n키링도 너무 귀여워.\n매일매일 닦아줘야지."
  },
  {
    id: "m15",
    date: "2026. 02. 21",
    text: "선물 뭐 주지?\n뭔가 만들어서 주고 싶은데...\n몰라, 더 고민해볼래."
  },
  {
    id: "m14",
    date: "2026. 02. 20",
    text: "- 추가_고용_제안서.txt\n- [붙임1]저택_구조_및_고용_형태.txt"
  },
  {
    id: "m13",
    date: "2026. 02. 19",
    text: "미즈키랑 데이트~\n옷 뭐입지?"
  },
  {
    id: "m12",
    date: "2026. 02. 19",
    text: "휴대폰 잃어버릴 뻔w\n찾아서 다행이야."
  },
  {
    id: "m11",
    date: "2026. 02. 18",
    text: "...한동안 아이스크림 못먹겠네."
  },
  {
    id: "m10",
    date: "2026. 02. 15",
    text: "정말 좋은 꿈이었어...\n어릴때 사진 있냐고 물어볼까?"
  },
  {
    id: "m9",
    date: "2026. 02. 14",
    text: "다음에 또 만들어달라고 해야지~\n나만 먹을 거야."
  },
  {
    id: "m8",
    date: "2026. 02. 14",
    text: "-버터 100g (무염)\n-설탕 90g... 백설탕?\n-박력분? 중력분?"
  },
  {
    id: "m7",
    date: "2026. 02. 11",
    text: "노란색도 잘 어울릴 것 같던데.\n은행나무 예쁜 곳 좀 알아볼까..."
  },
  {
    id: "m6",
    date: "2026. 02. 10",
    text: "공주님, 왕자님...\n또 뭐했더라."
  },
  {
    id: "m5",
    date: "2026. 02. 07",
    text: "목도리 좋아해줬으면 좋겠다.\n겨울 다 끝나가지만ww"
  },
  {
    id: "m4",
    date: "2026. 02. 05",
    text: "감기약 뭐가 제일 효과 좋지?\n집사님한테 물어봐야지."
  },
  {
    id: "m3",
    date: "2026. 02. 04",
    text: "미즈키 시력 엄청 낮구나...\n진짜 어지러웠어w\n비슷한 디자인이나 찾아볼까."
  },
  {
    id: "m2",
    date: "2026. 02. 03",
    text: "히어로 나쁘지 않네."
  },
  {
    id: "m1",
    date: "2026. 02. 02",
    text: "고, 고백…\n나 얼굴 흉하진 않았겠지?!"
  }
];
